In [2]:
import pandas as pd

#read csv
df=pd.read_csv('xldata.csv')
print(df)

#clean the empty columns
df_cleaned_row=df.dropna(how="all")

df_cleaned_col = df.dropna(axis=1, how='all')
print(df_cleaned_row)

      name  age         place  salary  empty
0   navani   23     kolathara   45000    NaN
1  shuhaib   23      thikkodi   50000    NaN
2    ayana   24    cherukulam   55000    NaN
3    akash   24        kovoor   60000    NaN
4   sharon   23  malapparamba   65000    NaN
5   akshay   23        mavoor   70000    NaN
      name  age         place  salary  empty
0   navani   23     kolathara   45000    NaN
1  shuhaib   23      thikkodi   50000    NaN
2    ayana   24    cherukulam   55000    NaN
3    akash   24        kovoor   60000    NaN
4   sharon   23  malapparamba   65000    NaN
5   akshay   23        mavoor   70000    NaN

In [3]:
df_cleaned_col = df.dropna(axis=1, how='all')
print(df_cleaned_col)

      name  age         place  salary
0   navani   23     kolathara   45000
1  shuhaib   23      thikkodi   50000
2    ayana   24    cherukulam   55000
3    akash   24        kovoor   60000
4   sharon   23  malapparamba   65000
5   akshay   23        mavoor   70000

In [5]:
#filling data intothe empty columns
df_filled_data = df.fillna(0)
print(df_filled_data)

      name  age         place  salary  empty
0   navani   23     kolathara   45000    0.0
1  shuhaib   23      thikkodi   50000    0.0
2    ayana   24    cherukulam   55000    0.0
3    akash   24        kovoor   60000    0.0
4   sharon   23  malapparamba   65000    0.0
5   akshay   23        mavoor   70000    0.0